
-- delete from categorySet;
-- select * from categorySet 
-- where name = N'Гостиница';

-- укрупненные категории

insert into "CategorySet"
("Id", "Name", "NaviId", "ParentId")
values
(1, N'Гостиницы и автомобили', null, null),
(2, N'Развлечения и праздники', null, null),
(3, N'Кафе, рестораны и бары', null, null),
(4, N'Красота, здоровье и спорт', null, null),
(5, N'Магазины', null, null),
(6, N'Финансы и бизнес', null, null),
(7, N'Другое', null, null);

-- дочерние категории
insert into "CategorySet"
("Id", "Name", "NaviId", "ParentId")
values
(8, N'Гостиница', 2, 1),
(9, N'Дом', 35, 1),
(10, N'Автозаправка', 32, 1),
(11, N'Автосалон/автосервис', 8, 1),
(12, N'День рождения', 19, 2),
(13, N'Кинотеатр', 33, 2),
(14, N'Концерт', 37, 2),
(15, N'Музей', 34, 2),
(16, N'Ночной клуб', 3, 2),
(17, N'Пикник', 41, 2),
(18, N'Праздник', 36, 2),
(19, N'Свидание', 40, 2),
(20, N'Сезонные праздники', 18, 2),
(21, N'Танцы', 39, 2),
(22, N'Фестиваль', 38, 2),
(23, N'Фотосессия', 43, 2),
(24, N'Выставка', 22, 2),
(25, N'Достопримечательность', 11, 2),
(26, N'Бар', 5, 3),
(27, N'Кафе', 6, 3),
(28, N'Ресторан', 4, 3),
(29, N'Аптека', 14, 4),
(30, N'Больница', 31, 4),
(31, N'Врач', 28, 4),
(32, N'Салон красоты', 13, 4),
(33, N'Стоматология', 23, 4),
(34, N'Фитнес клуб', 15, 4),
(35, N'Марафон', 42, 4),
(36, N'Спортивное событие', 21, 4),
(37, N'Бутик', 1, 5),
(38, N'Магазин', 9, 5),
(39, N'Магазин одежды', 24, 5),
(40, N'Магазин электроники', 25, 5),
(41, N'Товары для дома', 26, 5),
(42, N'Торговый центр', 7, 5),
(43, N'Свадебный салон', 17, 5),
(44, N'Супермаркет', 27, 5),
(45, N'Банк', 12, 6),
(46, N'Банкомат', 29, 6),
(47, N'Бизнес-центр', 0, 6),
(48, N'Офис', 10, 6),
(49, N'Встреча', 20, 7),
(50, N'Википедия', 44, 7),
(51, N'Образовательное учреждение', 30, 7),
(52, N'Другое', 16, 7)
;

