use [TravelHelperDatabase];

-- delete from categorySet;
-- select * from categorySet 
-- where name = N'Гостиница';

-- укрупненные категории
SET IDENTITY_INSERT CategorySet ON;
insert into CategorySet
(id, Name, NaviId, Parent_Id)
values
(1, N'Гостиницы и автомобили', null, null),
(2, N'Развлечения и праздники', null, null),
(3, N'Кафе, рестораны и бары', null, null),
(4, N'Красота, здоровье и спорт', null, null),
(5, N'Магазины', null, null),
(6, N'Финансы и бизнес', null, null),
(7, N'Другое', null, null);
SET IDENTITY_INSERT CategorySet OFF;

-- дочерние категории
insert into CategorySet
(Name, NaviId, Parent_Id)
values
(N'Гостиница', 2, 1),
(N'Дом', 35, 1),
(N'Автозаправка', 32, 1),
(N'Автосалон/автосервис', 8, 1),
(N'День рождения', 19, 2),
(N'Кинотеатр', 33, 2),
(N'Концерт', 37, 2),
(N'Музей', 34, 2),
(N'Ночной клуб', 3, 2),
(N'Пикник', 41, 2),
(N'Праздник', 36, 2),
(N'Свидание', 40, 2),
(N'Сезонные праздники', 18, 2),
(N'Танцы', 39, 2),
(N'Фестиваль', 38, 2),
(N'Фотосессия', 43, 2),
(N'Выставка', 22, 2),
(N'Достопримечательность', 11, 2),
(N'Бар', 5, 3),
(N'Кафе', 6, 3),
(N'Ресторан', 4, 3),
(N'Аптека', 14, 4),
(N'Больница', 31, 4),
(N'Врач', 28, 4),
(N'Салон красоты', 13, 4),
(N'Стоматология', 23, 4),
(N'Фитнес клуб', 15, 4),
(N'Марафон', 42, 4),
(N'Спортивное событие', 21, 4),
(N'Бутик', 1, 5),
(N'Магазин', 9, 5),
(N'Магазин одежды', 24, 5),
(N'Магазин электроники', 25, 5),
(N'Товары для дома', 26, 5),
(N'Торговый центр', 7, 5),
(N'Свадебный салон', 17, 5),
(N'Супермаркет', 27, 5),
(N'Банк', 12, 6),
(N'Банкомат', 29, 6),
(N'Бизнес-центр', 0, 6),
(N'Офис', 10, 6),
(N'Встреча', 20, 7),
(N'Википедия', 44, 7),
(N'Образовательное учреждение', 30, 7),
(N'Другое', 16, 7)
;
